{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "Pad", 
      "name": "flow_imagenet/Conv3d_1a_7x7/conv_3d//pad", 
      "attr": {
        "constant_value": "0", 
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 2, 3, 2, 3, 2, 3)"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Conv3d_1a_7x7/conv_3d/_weight", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(7, 7, 7)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0, 0)", 
        "stride": "(2, 2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "flow_imagenet/Conv3d_1a_7x7/conv_3d/", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(7, 7, 7)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0, 0)", 
        "stride": "(2, 2, 2)"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Conv3d_1a_7x7/batch_norm/_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Conv3d_1a_7x7/batch_norm/_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Conv3d_1a_7x7/batch_norm/_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Conv3d_1a_7x7/batch_norm/_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "flow_imagenet/Conv3d_1a_7x7/batch_norm/", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 1], [7, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "flow_imagenet/Conv3d_1a_7x7/relu/", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "flow_imagenet/MaxPool3d_2a_3x3//pad", 
      "attr": {
        "constant_value": "0", 
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 0, 0, 0, 1, 0, 1)"
      }, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "flow_imagenet/MaxPool3d_2a_3x3/", 
      "attr": {
        "kernel": "(1, 3, 3)", 
        "pad": "(0, 0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(1, 2, 2)"
      }, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Conv3d_2b_1x1/conv_3d/_weight", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "flow_imagenet/Conv3d_2b_1x1/conv_3d/", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Conv3d_2b_1x1/batch_norm/_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Conv3d_2b_1x1/batch_norm/_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Conv3d_2b_1x1/batch_norm/_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Conv3d_2b_1x1/batch_norm/_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "flow_imagenet/Conv3d_2b_1x1/batch_norm/", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0], [16, 0, 1], [17, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "flow_imagenet/Conv3d_2b_1x1/relu/", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Conv3d_2c_3x3/conv_3d/_weight", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(3, 3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(1, 1, 1)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "flow_imagenet/Conv3d_2c_3x3/conv_3d/", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(3, 3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(1, 1, 1)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Conv3d_2c_3x3/batch_norm/_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Conv3d_2c_3x3/batch_norm/_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Conv3d_2c_3x3/batch_norm/_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Conv3d_2c_3x3/batch_norm/_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "flow_imagenet/Conv3d_2c_3x3/batch_norm/", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0], [23, 0, 0], [24, 0, 1], [25, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "flow_imagenet/Conv3d_2c_3x3/relu/", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "flow_imagenet/MaxPool3d_3a_3x3//pad", 
      "attr": {
        "constant_value": "0", 
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 0, 0, 0, 1, 0, 1)"
      }, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "flow_imagenet/MaxPool3d_3a_3x3/", 
      "attr": {
        "kernel": "(1, 3, 3)", 
        "pad": "(0, 0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(1, 2, 2)"
      }, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3b/Branch_0/Conv3d_0a_1x1/conv_3d/_weight", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "flow_imagenet/Mixed_3b/Branch_0/Conv3d_0a_1x1/conv_3d/", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[29, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3b/Branch_0/Conv3d_0a_1x1/batch_norm/_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3b/Branch_0/Conv3d_0a_1x1/batch_norm/_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3b/Branch_0/Conv3d_0a_1x1/batch_norm/_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3b/Branch_0/Conv3d_0a_1x1/batch_norm/_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "flow_imagenet/Mixed_3b/Branch_0/Conv3d_0a_1x1/batch_norm/", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": [[31, 0, 0], [32, 0, 0], [33, 0, 0], [34, 0, 1], [35, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "flow_imagenet/Mixed_3b/Branch_0/Conv3d_0a_1x1/relu/", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3b/Branch_1/Conv3d_0a_1x1/conv_3d/_weight", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "flow_imagenet/Mixed_3b/Branch_1/Conv3d_0a_1x1/conv_3d/", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[29, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3b/Branch_1/Conv3d_0a_1x1/batch_norm/_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3b/Branch_1/Conv3d_0a_1x1/batch_norm/_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3b/Branch_1/Conv3d_0a_1x1/batch_norm/_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3b/Branch_1/Conv3d_0a_1x1/batch_norm/_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "flow_imagenet/Mixed_3b/Branch_1/Conv3d_0a_1x1/batch_norm/", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": [[39, 0, 0], [40, 0, 0], [41, 0, 0], [42, 0, 1], [43, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "flow_imagenet/Mixed_3b/Branch_1/Conv3d_0a_1x1/relu/", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3b/Branch_1/Conv3d_0b_3x3/conv_3d/_weight", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(3, 3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1, 1)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "flow_imagenet/Mixed_3b/Branch_1/Conv3d_0b_3x3/conv_3d/", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(3, 3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1, 1)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[45, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3b/Branch_1/Conv3d_0b_3x3/batch_norm/_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3b/Branch_1/Conv3d_0b_3x3/batch_norm/_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3b/Branch_1/Conv3d_0b_3x3/batch_norm/_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3b/Branch_1/Conv3d_0b_3x3/batch_norm/_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "flow_imagenet/Mixed_3b/Branch_1/Conv3d_0b_3x3/batch_norm/", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": [[47, 0, 0], [48, 0, 0], [49, 0, 0], [50, 0, 1], [51, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "flow_imagenet/Mixed_3b/Branch_1/Conv3d_0b_3x3/relu/", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[52, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3b/Branch_2/Conv3d_0a_1x1/conv_3d/_weight", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "flow_imagenet/Mixed_3b/Branch_2/Conv3d_0a_1x1/conv_3d/", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[29, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3b/Branch_2/Conv3d_0a_1x1/batch_norm/_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3b/Branch_2/Conv3d_0a_1x1/batch_norm/_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3b/Branch_2/Conv3d_0a_1x1/batch_norm/_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3b/Branch_2/Conv3d_0a_1x1/batch_norm/_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "flow_imagenet/Mixed_3b/Branch_2/Conv3d_0a_1x1/batch_norm/", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": [[55, 0, 0], [56, 0, 0], [57, 0, 0], [58, 0, 1], [59, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "flow_imagenet/Mixed_3b/Branch_2/Conv3d_0a_1x1/relu/", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[60, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3b/Branch_2/Conv3d_0b_3x3/conv_3d/_weight", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(3, 3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1, 1)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "flow_imagenet/Mixed_3b/Branch_2/Conv3d_0b_3x3/conv_3d/", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(3, 3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1, 1)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[61, 0, 0], [62, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3b/Branch_2/Conv3d_0b_3x3/batch_norm/_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3b/Branch_2/Conv3d_0b_3x3/batch_norm/_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3b/Branch_2/Conv3d_0b_3x3/batch_norm/_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3b/Branch_2/Conv3d_0b_3x3/batch_norm/_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "flow_imagenet/Mixed_3b/Branch_2/Conv3d_0b_3x3/batch_norm/", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": [[63, 0, 0], [64, 0, 0], [65, 0, 0], [66, 0, 1], [67, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "flow_imagenet/Mixed_3b/Branch_2/Conv3d_0b_3x3/relu/", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[68, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "flow_imagenet/Mixed_3b/Branch_2/MaxPool3d_0a_3x3", 
      "attr": {
        "kernel": "(3, 3, 3)", 
        "pad": "(1, 1, 1)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3b/Branch_3/Conv3d_0b_1x1/conv_3d/_weight", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "flow_imagenet/Mixed_3b/Branch_3/Conv3d_0b_1x1/conv_3d/", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[70, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3b/Branch_3/Conv3d_0b_1x1/batch_norm/_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3b/Branch_3/Conv3d_0b_1x1/batch_norm/_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3b/Branch_3/Conv3d_0b_1x1/batch_norm/_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3b/Branch_3/Conv3d_0b_1x1/batch_norm/_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "flow_imagenet/Mixed_3b/Branch_3/Conv3d_0b_1x1/batch_norm/", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": [[72, 0, 0], [73, 0, 0], [74, 0, 0], [75, 0, 1], [76, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "flow_imagenet/Mixed_3b/Branch_3/Conv3d_0b_1x1/relu/", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[77, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "flow_imagenet/Mixed_3b/Concat", 
      "attr": {
        "dim": "1", 
        "num_args": "4"
      }, 
      "inputs": [[37, 0, 0], [53, 0, 0], [69, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3c/Branch_0/Conv3d_0a_1x1/conv_3d/_weight", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "flow_imagenet/Mixed_3c/Branch_0/Conv3d_0a_1x1/conv_3d/", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[79, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3c/Branch_0/Conv3d_0a_1x1/batch_norm/_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3c/Branch_0/Conv3d_0a_1x1/batch_norm/_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3c/Branch_0/Conv3d_0a_1x1/batch_norm/_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3c/Branch_0/Conv3d_0a_1x1/batch_norm/_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "flow_imagenet/Mixed_3c/Branch_0/Conv3d_0a_1x1/batch_norm/", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": [[81, 0, 0], [82, 0, 0], [83, 0, 0], [84, 0, 1], [85, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "flow_imagenet/Mixed_3c/Branch_0/Conv3d_0a_1x1/relu/", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[86, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3c/Branch_1/Conv3d_0a_1x1/conv_3d/_weight", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "flow_imagenet/Mixed_3c/Branch_1/Conv3d_0a_1x1/conv_3d/", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[79, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3c/Branch_1/Conv3d_0a_1x1/batch_norm/_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3c/Branch_1/Conv3d_0a_1x1/batch_norm/_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3c/Branch_1/Conv3d_0a_1x1/batch_norm/_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3c/Branch_1/Conv3d_0a_1x1/batch_norm/_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "flow_imagenet/Mixed_3c/Branch_1/Conv3d_0a_1x1/batch_norm/", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": [[89, 0, 0], [90, 0, 0], [91, 0, 0], [92, 0, 1], [93, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "flow_imagenet/Mixed_3c/Branch_1/Conv3d_0a_1x1/relu/", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3c/Branch_1/Conv3d_0b_3x3/conv_3d/_weight", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(3, 3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(1, 1, 1)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "flow_imagenet/Mixed_3c/Branch_1/Conv3d_0b_3x3/conv_3d/", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(3, 3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(1, 1, 1)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[95, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3c/Branch_1/Conv3d_0b_3x3/batch_norm/_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3c/Branch_1/Conv3d_0b_3x3/batch_norm/_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3c/Branch_1/Conv3d_0b_3x3/batch_norm/_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3c/Branch_1/Conv3d_0b_3x3/batch_norm/_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "flow_imagenet/Mixed_3c/Branch_1/Conv3d_0b_3x3/batch_norm/", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": [[97, 0, 0], [98, 0, 0], [99, 0, 0], [100, 0, 1], [101, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "flow_imagenet/Mixed_3c/Branch_1/Conv3d_0b_3x3/relu/", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3c/Branch_2/Conv3d_0a_1x1/conv_3d/_weight", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "flow_imagenet/Mixed_3c/Branch_2/Conv3d_0a_1x1/conv_3d/", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[79, 0, 0], [104, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3c/Branch_2/Conv3d_0a_1x1/batch_norm/_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3c/Branch_2/Conv3d_0a_1x1/batch_norm/_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3c/Branch_2/Conv3d_0a_1x1/batch_norm/_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3c/Branch_2/Conv3d_0a_1x1/batch_norm/_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "flow_imagenet/Mixed_3c/Branch_2/Conv3d_0a_1x1/batch_norm/", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": [[105, 0, 0], [106, 0, 0], [107, 0, 0], [108, 0, 1], [109, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "flow_imagenet/Mixed_3c/Branch_2/Conv3d_0a_1x1/relu/", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[110, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3c/Branch_2/Conv3d_0b_3x3/conv_3d/_weight", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(3, 3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1, 1)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "flow_imagenet/Mixed_3c/Branch_2/Conv3d_0b_3x3/conv_3d/", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(3, 3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1, 1)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[111, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3c/Branch_2/Conv3d_0b_3x3/batch_norm/_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3c/Branch_2/Conv3d_0b_3x3/batch_norm/_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3c/Branch_2/Conv3d_0b_3x3/batch_norm/_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3c/Branch_2/Conv3d_0b_3x3/batch_norm/_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "flow_imagenet/Mixed_3c/Branch_2/Conv3d_0b_3x3/batch_norm/", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": [[113, 0, 0], [114, 0, 0], [115, 0, 0], [116, 0, 1], [117, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "flow_imagenet/Mixed_3c/Branch_2/Conv3d_0b_3x3/relu/", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[118, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "flow_imagenet/Mixed_3c/Branch_2/MaxPool3d_0a_3x3", 
      "attr": {
        "kernel": "(3, 3, 3)", 
        "pad": "(1, 1, 1)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[79, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3c/Branch_3/Conv3d_0b_1x1/conv_3d/_weight", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "flow_imagenet/Mixed_3c/Branch_3/Conv3d_0b_1x1/conv_3d/", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[120, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3c/Branch_3/Conv3d_0b_1x1/batch_norm/_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3c/Branch_3/Conv3d_0b_1x1/batch_norm/_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3c/Branch_3/Conv3d_0b_1x1/batch_norm/_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_3c/Branch_3/Conv3d_0b_1x1/batch_norm/_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "flow_imagenet/Mixed_3c/Branch_3/Conv3d_0b_1x1/batch_norm/", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": [[122, 0, 0], [123, 0, 0], [124, 0, 0], [125, 0, 1], [126, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "flow_imagenet/Mixed_3c/Branch_3/Conv3d_0b_1x1/relu/", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[127, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "flow_imagenet/Mixed_3c/Concat", 
      "attr": {
        "dim": "1", 
        "num_args": "4"
      }, 
      "inputs": [[87, 0, 0], [103, 0, 0], [119, 0, 0], [128, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "flow_imagenet/MaxPool3d_4a_3x3//pad", 
      "attr": {
        "constant_value": "0", 
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 0, 1, 0, 1, 0, 1)"
      }, 
      "inputs": [[129, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "flow_imagenet/MaxPool3d_4a_3x3/", 
      "attr": {
        "kernel": "(3, 3, 3)", 
        "pad": "(0, 0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2, 2, 2)"
      }, 
      "inputs": [[130, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_4b/Branch_0/Conv3d_0a_1x1/conv_3d/_weight", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "flow_imagenet/Mixed_4b/Branch_0/Conv3d_0a_1x1/conv_3d/", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[131, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_4b/Branch_0/Conv3d_0a_1x1/batch_norm/_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_4b/Branch_0/Conv3d_0a_1x1/batch_norm/_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_4b/Branch_0/Conv3d_0a_1x1/batch_norm/_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_4b/Branch_0/Conv3d_0a_1x1/batch_norm/_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "flow_imagenet/Mixed_4b/Branch_0/Conv3d_0a_1x1/batch_norm/", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": [[133, 0, 0], [134, 0, 0], [135, 0, 0], [136, 0, 1], [137, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "flow_imagenet/Mixed_4b/Branch_0/Conv3d_0a_1x1/relu/", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[138, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_4b/Branch_1/Conv3d_0a_1x1/conv_3d/_weight", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "flow_imagenet/Mixed_4b/Branch_1/Conv3d_0a_1x1/conv_3d/", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[131, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_4b/Branch_1/Conv3d_0a_1x1/batch_norm/_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_4b/Branch_1/Conv3d_0a_1x1/batch_norm/_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_4b/Branch_1/Conv3d_0a_1x1/batch_norm/_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_4b/Branch_1/Conv3d_0a_1x1/batch_norm/_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "flow_imagenet/Mixed_4b/Branch_1/Conv3d_0a_1x1/batch_norm/", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": [[141, 0, 0], [142, 0, 0], [143, 0, 0], [144, 0, 1], [145, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "flow_imagenet/Mixed_4b/Branch_1/Conv3d_0a_1x1/relu/", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[146, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_4b/Branch_1/Conv3d_0b_3x3/conv_3d/_weight", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(3, 3, 3)", 
        "no_bias": "True", 
        "num_filter": "208", 
        "pad": "(1, 1, 1)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "flow_imagenet/Mixed_4b/Branch_1/Conv3d_0b_3x3/conv_3d/", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(3, 3, 3)", 
        "no_bias": "True", 
        "num_filter": "208", 
        "pad": "(1, 1, 1)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[147, 0, 0], [148, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_4b/Branch_1/Conv3d_0b_3x3/batch_norm/_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_4b/Branch_1/Conv3d_0b_3x3/batch_norm/_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_4b/Branch_1/Conv3d_0b_3x3/batch_norm/_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_4b/Branch_1/Conv3d_0b_3x3/batch_norm/_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "flow_imagenet/Mixed_4b/Branch_1/Conv3d_0b_3x3/batch_norm/", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": [[149, 0, 0], [150, 0, 0], [151, 0, 0], [152, 0, 1], [153, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "flow_imagenet/Mixed_4b/Branch_1/Conv3d_0b_3x3/relu/", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[154, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_4b/Branch_2/Conv3d_0a_1x1/conv_3d/_weight", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "flow_imagenet/Mixed_4b/Branch_2/Conv3d_0a_1x1/conv_3d/", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "pad": "(0, 0, 0)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[131, 0, 0], [156, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_4b/Branch_2/Conv3d_0a_1x1/batch_norm/_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_4b/Branch_2/Conv3d_0a_1x1/batch_norm/_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_4b/Branch_2/Conv3d_0a_1x1/batch_norm/_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_4b/Branch_2/Conv3d_0a_1x1/batch_norm/_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "flow_imagenet/Mixed_4b/Branch_2/Conv3d_0a_1x1/batch_norm/", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": [[157, 0, 0], [158, 0, 0], [159, 0, 0], [160, 0, 1], [161, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "flow_imagenet/Mixed_4b/Branch_2/Conv3d_0a_1x1/relu/", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[162, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_4b/Branch_2/Conv3d_0b_3x3/conv_3d/_weight", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(3, 3, 3)", 
        "no_bias": "True", 
        "num_filter": "48", 
        "pad": "(1, 1, 1)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "flow_imagenet/Mixed_4b/Branch_2/Conv3d_0b_3x3/conv_3d/", 
      "attr": {
        "dilate": "(1, 1, 1)", 
        "kernel": "(3, 3, 3)", 
        "no_bias": "True", 
        "num_filter": "48", 
        "pad": "(1, 1, 1)", 
        "stride": "(1, 1, 1)"
      }, 
      "inputs": [[163, 0, 0], [164, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "flow_imagenet/Mixed_4b/Branch_2/Conv3d_0b_3x3/batch_norm/_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.001", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
